In [1]:
from utils.io import gen_id_dated, gdf_viewer, gdf_geom, gdf_merger, na_col_drop, na_line_drop
import re, os
import numpy as np
import geopandas as gpd
import pandas as pd
from shapely.geometry import Point
import datetime as dtm
import matplotlib.pyplot as plt
from definitions import ROOT_DIR

In [2]:
t1 = pd.DataFrame({'ID':['id1','id2','id3','id4','id5','id6','id7','id8'],'Name':['A','B','C','D','E','F','G','H'],
                   'Value':[1,2,3,4,np.nan,5,np.nan,7]})
t2 = pd.DataFrame({'ID':['id1','id2','id3','id4','id5','id6','id7','id8'],'Name':['A','B','D','C','E','F','G','h'],
                   'Value':[1,3,2,4,np.nan,np.nan,6,7]})

In [3]:
t1.merge(t2, on='ID', how='outer')

    ID Name_x  Value_x Name_y  Value_y
0  id1      A      1.0      A      1.0
1  id2      B      2.0      B      3.0
2  id3      C      3.0      D      2.0
3  id4      D      4.0      C      4.0
4  id5      E      NaN      E      NaN
5  id6      F      5.0      F      NaN
6  id7      G      NaN      G      6.0
7  id8      H      7.0      h      7.0

In [4]:
gdf_merger(t1,t2, col='ID', how='outer', non_na=0)[0]

Ambiguous values in both columns compared, change it manually !
Columns ['ID', 'Value_x', 'Value_y', 'Name_x', 'Name_y'] must be dropped manually !
error file created in 'tmp_files/merging_error_log(-).csv'

    ID Name_x  Value_x Name_y  Value_y  Value Name
0  id1    NaN      NaN    NaN      NaN    1.0    A
1  id2    NaN      2.0    NaN      3.0    NaN    B
2  id3      C      3.0      D      2.0    NaN  NaN
3  id4      D      NaN      C      NaN    4.0  NaN
4  id5    NaN      NaN    NaN      NaN    NaN    E
5  id6    NaN      NaN    NaN      NaN    5.0    F
6  id7    NaN      NaN    NaN      NaN    6.0    G
7  id8    NaN      NaN    NaN      NaN    7.0    H

In [5]:
gdf_merger(t1,t2, col='ID', how='outer', non_na=0)[1]

Ambiguous values in both columns compared, change it manually !
Columns ['ID', 'Value_x', 'Value_y', 'Name_x', 'Name_y'] must be dropped manually !
error file created in 'tmp_files/merging_error_log(-).csv'

    ID  Value_x  Value_y Name_x Name_y
0  id2      2.0      3.0      B      B
1  id3      3.0      2.0      C      D
2  id4      4.0      4.0      D      C